Revit 2026 API

# ExporterIFCGetLayerNameForPresentationLayer Method

---

Get the layer name associated with an element from the default layer mapping table.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetLayerNameForPresentationLayer(
	Element pElement,
	ElementId categoryId
)
```
```vb
Public Function GetLayerNameForPresentationLayer (
	pElement As Element,
	categoryId As ElementId
) As String
```
```cpp
public:
String^ GetLayerNameForPresentationLayer(
	Element^ pElement,
	ElementId^ categoryId
)
```
```fsharp
member GetLayerNameForPresentationLayer :
        pElement : Element *
        categoryId : ElementId -> string
```

#### Parameters

pElement Element
     The element.
categoryId ElementId
     The category id of the element.

#### Return Value

String The layer name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace